garyPenhook/PyAvrOCD/svd/avr128da64.svd
        <register>
          <name>USEREVSYSEVOUTD</name>
          <description>User 17 - EVOUTD</description>
          <addressOffset>0x31</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USEREVSYSEVOUTE</name>
          <description>User 18 - EVOUTE</description>
          <addressOffset>0x32</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USEREVSYSEVOUTF</name>
          <description>User 19 - EVOUTF</description>
          <addressOffset>0x33</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USEREVSYSEVOUTG</name>
          <description>User 20 - EVOUTG</description>
          <addressOffset>0x34</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERPTCSTART</name>
          <description>User 13 - PTC</description>
          <addressOffset>0x2D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERTCA0CNTA</name>
          <description>User 27 - TCA0 Event A</description>
          <addressOffset>0x3B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERTCA0CNTB</name>
          <description>User 28 - TCA0 Event B</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL6</name>
                  <description>Connect user to event channel 6</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL7</name>
                  <description>Connect user to event channel 7</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL8</name>
                  <description>Connect user to event channel 8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL9</name>
                  <description>Connect user to event channel 9</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
